{
  "Chapters": [
    {
    "title":"HTML",
    "name":"html tutorial",
    "shortname":"html",

    "module1":"HTML Overview",
    "content1":"What is HTML?",
    "ans11":"HTML stands for Hyper Text Markup Language.Hypertext refers to a way in which pages are linked together and available on web page is known as Hypertext.Unlike,scripting and programming languages,a markup language uses tags to identify the content.",
    "ans12":"<!DOCTYPE html> - defines the document type and the Html version to the Browser.",
    "ans13":"<html> - is the root element of the html page.",
    "ans14":"<head> - is the header of the document which keep other html tags like <link> , <title> , etc",
    "ans15":"<body> - defines the content of the document.",
    "ans16":"HTML Tags - HTML Tags comes in pairs like <html> and </html>. The first tag is the opening tag and the other one is the closing tag.",
    "Example1":"html_01",

    "module2":"HTML Basics",
    "content2":"HTML Documents , Headings , Paragraphs : ",
    "ans21":"HTML Documents start with the decelaration of <!DOCTYPE html>. Mainly <!DOCTYPE html> comes from HTML5 ,  before that every html document starts with <html> and ends with </html>.The main content or body of the page comes under the body tag <body> and rest every content has its different tags , which will be discussed in further modules.",
    "ans22":"HTML includes six levels of headings, which are ranked according to importance.These are <h1>, <h2>, <h3>, <h4>, <h5>, and <h6>.",
    "ans23":"HTML <p> tag is used to define the paragraphs of the document",
    "ans24":"Horizontal Lines : To create a horizontal line a <hr /> tag is required.",
    "ans25":"Break Statements : For breaking lines of the paragraph we need a <br /> tag.",
    "ans26":"For above statements you can refer to the example and see their outputs. ",
    "Example2":"html_02",

    "module3":"HTML Images",
    "content3":"HTML Elements , Attributes , Images : ",
    "ans31":"HTML Documents are made up of HTML elements.An HTML Element consits of a start tag and an end tag and with the content in between.",
    "ans32":"HTML Documents consist of nested HTML elements. For example , the body element includes the <p> tags,<img> tags, <h2> tags,etc.",
    "ans33":"HTML Attributes are within the html elements.Attributes provide additional information about the element",
    "ans34":"Attributes comes in a name and value pair.For example, height='25px' , where height is the name and 25px is the value of the attribute. ",
    "ans35":"Now,the image consists of <img /> tag , which is used to insert the image within the web page.An image tag only consists of attributes , it doesnt have a closing tag.",
    "ans36":"We need to put the image location for the src attribute that is between the quotation marks.For example, if you have a photo named 'img_girl.jpg' in the same folder as the HTML file,you can refer to the example",
    "Example3":"html_03",

    "module4":"HTML Links,Lists",
    "content4":"",
    "ans41":"Links are also an integral part of every web page. You can add links to text or images that will enable the user to click on them in order to be directed to another file or webpage.In HTML, links are defined using the <a> tag.",
    "ans42":"<a> tag stands for anchor tag which uses the 'href' attribute to define the the link's destination address :",
    "ans43":"Syntax : <a href='https://www.google.com/' />",
    "ans44":"HTML Ordered Lists : An Ordered list starts with the <ol> tag, and each list item is defined by the <li> tag.The list items will be marked with numbers. ",
    "ans45":"HTML UnOrdered Lists : An UnOrdered list starts with the <ul> tag. Each list item starts with the <li> tag.The list items will be marked with bullets. ",
    "ans46":"HTML Description Lists : A Description list is a list of terms, with a description of each term.The <dl> tag defines the description list, the <dt> tag defines the term (name), and the <dd> tag describes each term.",
    "Example4":"html_04",

    "module5":"HTML Tables",
    "content5":"Tables are defined by using the <table> tag.",
    "ans51":"Tables are divided into table rows with the <tr> tag.",
    "ans52":"Table rows are divided into table columns with the <td> tag.",
    "ans53":"A table header is defined with the <th> tag. By default, table headings are bold and centered.",
    "ans54":"Border : A border can be added into the table tag using the border attribute",
    "ans55":"Colspan : A table cell can span two or more columns",
    "ans56":"Rowsapn : To make a cell span more than one row, use the rowspan attribute.",
    "Example5":"html_05",

    "module6":"HTML Forms",
    "content6":"The <form> Element",
    "ans61":"HTML forms are used to collect information from the user.Forms are defined using the <form> element, with its opening and closing tags.",
    "ans62":"Use the action attribute to point to a webpage that will load after the user submits the form.",
    "ans63":"The method attribute specifies the HTTP method (GET or POST) to be used when forms are submitted.When you use GET, the form data will be visible in the page address.Use POST if the form is updating data, or includes sensitive information (passwords).POST offers better security because the submitted data is not visible in the page address.",
    "ans64":"To take in user input, you need the corresponding form elements, such as text fields. The <input> element has many variations, depending on the type attribute. It can be a text, password, radio, URL, submit, etc.",
    "ans65":"If we change the input type to radio, it allows the user select only one of a number of choices.The type 'checkbox' allows the user to select more than one option.",
    "ans66":"The submit button submits a form to its action attribute.",
    "Example6":"html_06",

    "module7":"HTML 5 Introduction",
    "content7":"What's new in HTML 5??",
    "ans71":"When writing HTML5 documents, one of the first new features that you'll notice is the doc type declaration:<!DOCTYPE HTML> ",
    "ans72":"The character encoding (charset) declaration is also simplified:<meta charset='UTF-8'> [Defines metadata for an HTML document]",
    "ans73":"The method attribute specifies the HTTP method (GET or POST) to be used when forms are submitted.When you use GET, the form data will be visible in the page address.Use POST if the form is updating data, or includes sensitive information (passwords).POST offers better security because the submitted data is not visible in the page address.",
    "ans74":"New Elements in HTML5 : <article>, <aside>, <audio>, <canvas>, <datalist>, <details>, <embed>, <footer>, <header>, <nav>, <output>, <progress>, <section>, <video>, and even more!",
    "ans75":"New HTML 5 APIs : Drag and Drop ; Local Storage ; History ; Geolocation ; Audio and Video ; etc..",
    "ans76":"New HTML 5 Forms : allow for the creation of more powerful forms and compelling user experiences , Date pickers , Color pickers have been added.Input field now include emails , Url and new form methods 'PUT' and 'DELETE' are now supported.",
    "Example7":"html_07",

    "module8":"HTML 5 section,article",
    "content8":"article , section , aside",
    "ans81":"The <article> Element : Article is a self-contained, independent piece of content that can be used and distributed separately from the rest of the page or site. This could be a forum post, a magazine or newspaper article, a blog entry, a comment, an interactive widget or gadget, or any other independent piece of content.",
    "ans82":"The <article> element replaces the <div> element that was widely used in HTML4, along with an id or class.",
    "ans83":"The <section> Element : <section> is a logical container of the page or article.Sections can be used to divide up content within an article.",
    "ans84":"New Elements in HTML5 : <article>, <aside>, <audio>, <canvas>, <datalist>, <details>, <embed>, <footer>, <header>, <nav>, <output>, <progress>, <section>, <video>, and even more!",
    "ans85":"Each <section> should be identified, typically by including a heading (h1-h6 element) as a child of the <section> element.",
    "ans86":"<aside> is secondary or tangential content which could be considered separate from but indirectly related to the main content.When an <aside> tag is used within an <article> tag, the content of the <aside> should be specifically related to that article.",
    "Example8":"html_08",

    "module9":"HTML 5 Audio and Video Element",
    "content9":"audio and video",
    "ans91":"Audio : Before HTML5, there was no standard for playing audio files on a web page.The HTML5 <audio> element specifies a standard for embedding audio in a web page.",
    "ans92":"The <audio> element creates an audio player inside the browser.Currently, there are three supported file formats for the <audio> element: MP3, WAV, and OGG.",
    "ans93":"Syntax : <audio src='' controls> </audio>",
    "ans94":"Video : The video element is similar to the audio element.You can specify the video source URL using an attribute in a video element, or using source elements inside the video element:",
    "ans95":"Another aspect shared by both the audio and the video elements is that each has controls, autoplay and loop attributes.",
    "ans96":"Syntax : <video src='' controls autoplay> </video>",
    "Example9":"html_09",

    "module10":"HTML 5 SVG",
    "content10":"SVG",
    "ans101":"SVG stands for Scalable Vector Graphics, and is used to draw shapes with HTML-style markup.It offers several methods for drawing paths, boxes, circles, text, and graphic images.",
    "ans102":"An SVG image can be added to HTML code with just a basic image tag that includes a source attribute pointing to the image:",
    "ans103":"To draw shapes with SVG, you first need to create an SVG element tag with two attributes: width and height.Syntax : <svg width='1000' height='1000'></svg>",
    "ans104":"To create a circle, add a <circle> tag. for example. : <circle cx='50' cy='50' r='40' fill='yellow' stroke='green' stroke-width='4' />",
    "ans105":"where, cx : pushes the center of the circle further to the right of the screen ; cy : pushes the center of the circle further down from the top of the screen ; r : defines the radius ; fill : determines the color of our circle ; stroke : adds an outline to the circle",
    "ans106":"Similarly, other shapes like rectangle <rect> , ellipse <ellipse> , polygon <polygon> can also be created within SVG.",
    "Example10":"html_10",

    "module11":"HTML 5 Canvas",
    "content11":"Canvas",
    "ans111":"The HTML canvas <canvas> is used to draw graphics that include everything from simple lines to complex graphic objects.",
    "ans112":"The <canvas> element is only a container for graphics.The <canvas> element is defined by : ",
    "ans113":"<canvas id='canvas1' width='200' height='100'></canvas>",
    "ans114":"Canvas Coordinates : The HTML canvas is a two-dimensional grid (0,0).",
    "ans115":"X coordinate increases to the right. Y coordinate increases toward the bottom of the canvas.",
    "ans116":"You must use JavaScript to actually draw the graphics.Canvas has several methods for drawing paths, boxes, circles, text, and adding images.",
    "Example11":"html_11",

    "module12":"HTML 5 Forms Validation",
    "content12":"Form Validation",
    "ans121":"HTML5 brings many features and improvements to web form creation. There are new attributes and input types that were introduced to help create better experiences for web users.",
    "ans122":"<label> tag : Label tag defines the label for the <button> , <input> tags",
    "ans123":"HTML5 has introduced a new attribute called placeholder. On <input> and <textarea> elements, this attribute provides a hint to the user of what information can be entered into the field.",
    "ans124":"Required attribute : The 'required' attribute is used to make the input elements required.The form will not be submitted without filling in the required fields.",
    "ans125":"Search box : The new search input type can be used to create a search box : <input id='mysearch' name='searchitem' type='search' />",
    "ans126":"Some other new input types include email, url, and tel",
    "Example12":"html_12"


    }
  ,{
    "title":"CSS",
    "name":"css tutorial",
    "shortname":"css",

    "module1":"CSS Overview",
    "content1":"What is CSS?",
    "ans11":"CSS stands for Cascading Style Sheets,which describes the style of the html elements. CSS describes how HTML elements are to be displayed on screen, paper, or in other media CSS saves a lot of work. It can control the layout of multiple web pages all at once.",
    "ans12":"Cascading - refers to the way CSS applies one style on top of another.",
    "ans13":"Style Sheets - control the look and feel of web documents.",
    "ans14":"CSS and HTML work hand in hand : To understand CSS you should know the basic knowledge of HTML.",
    "ans15":"HTML - sorts out the page structure.",
    "ans16":"CSS - defines how html elements are displayed.There are three ways of inserting Css stylesheets : 'External Css','Internal Css','Inline Css'.",
    "Example1":"Css_01",

    "module2":"CSS Basics",
    "content2":"CSS Selectors : ",
    "ans21":"A CSS rule-set consists of a selector and a declaration block : h1 {color:blue;} where, h1 is the document's element , color is the property and blue is its value. ",
    "ans22":"The selector points to the HTML element you want to style.",
    "ans23":"Css Comments : Comments are used to explain the code , which are ignore by the browsers.A CSS comment starts with /* and ends with */.",
    "ans24":"Element Selector : The element selector selects HTML elements based on the element name.",
    "ans25":"Id Selector : The id selector uses the id attribute of an HTML element to select a specific element.To select an element with a specific id, write a hash (#) character, followed by the id of the element.",
    "ans26":"Class Selector : To select elements with a specific class, write a dot notation (.) character, followed by the class name.Elements can also refer to more than one class.The universal selector (*) selects all HTML elements.",
    "Example2":"Css_02",

    "module3":"Working with the Text",
    "content3":"CSS font , color , text : ",
    "ans31":"",
    "ans32":"Font-size : The font-size property sets the size of a font.For example xx-small, small, medium, large, larger, etc.You can also use numerical values in pixels or ems to manipulate font size.",
    "ans33":"Font-style : The font-style property has three values: normal, italic, and oblique.The font-weight controls the boldness or thickness of the text.",
    "ans34":"Font-family : The font-family property specifies the font for an element.There are two types of font family names:font family: a specific font family and generic family",
    "ans35":"Color property : The CSS color property specifies the color of the text.Another way of defining colors is using hexadecimal values and RGB.",
    "ans36":"Text-decoration property : The text-decoration property specifies how the text will be decorated.Commonly used values are : none , inherit , underline , overline , line through.",
    "Example3":"Css_03",

    "module4":"Box Model",
    "content4":"Introduction to Box Model and Borders :  ",
    "ans41":"All HTML elements can be considered as boxes. The CSS box model represents the design and layout of the site. It consists of margins, borders, paddings, and the actual content.The properties work in the same order: top, right, bottom, and left",
    "ans42":"",
    "ans43":"When working with boxes, it is important to understand how the total width of an element is calculated.The total width of the box with paddings , borders and margins  will be the sum of width + padding left + padding right + left border + right border + left margin + right margin .",
    "ans44":"The total height of an element is calculated the same way as the width.",
    "ans45":"Borders : In order to add a border to the element, you need to specify the size, style, and color of the border.",
    "ans46":"border-style property:There are various styles supported for the border-style property: none(default),dotted, dashed, double, etc. .",
    "Example4":"Css_04",

    "module5":"Background Properties",
    "content5":"",
    "ans51":"The background-color property is used to specify the background color of an element.The background-image property sets one or several background images in an element.",
    "ans52":"",
    "ans53":"The background repeat property specifies how background images are repeated. A background image can be repeated along the horizontal axis (repeat-x), the vertical axis (repeat-y), both axes, or not repeated at all.",
    "ans54":"The background-attachment property sets whether a background image is fixed or scrolls with the rest of the page.",
    "ans55":"The background-position property is used to specify the position of the background image.",
    "ans56":"",
    "Example5":"Css_05",

    "module6":"Styling Lists",
    "content6":"",
    "ans61":"The CSS list properties allow us to set different list item markers.Set different list item markers for ordered lists.Set different list item markers for unordered lists.Set an image as the list item marker.Add background colors to lists and list items",
    "ans62":"The list-style-position property specifies the position of the list-item markers (bullet points).In HTML, there are two types of lists : ",
    "ans63":"unordered lists (<ul>) - the list items are marked with bullets" ,
    "ans64":"ordered lists (<ol>) - the list items are marked with numbers or letters",
    "ans65":"other list properties, such as:list-style-image - specifies an image to be used as the list item marker.",
    "ans66":"The list-style property is a shorthand property for setting list-style-type, list-style-image and list-style-position. It is used to set all of the list properties in one declaration.We can also style lists with colors, to make them look a little more interesting.Anything added to the <ol> or <ul> tag, affects the entire list, while properties added to the <li> tag will affect the individual list items.",
    "Example6":"Css_06",

    "module7":"Styling Tables",
    "content7":"The Table Properties : ",
    "ans71":"The border-collapse property specifies whether the table borders are collapsed into a single border or separated as default. If the borders are separate, the border-spacing property can be used to change the spacing.",
    "ans72":"To control the space between the border and the content in a table, use the padding property on <td> and <th> elements.The caption-side property specifies the position of a table caption. The values can be set as top or bottom.",
    "ans73":"Syntax: caption { caption-side: top; }" ,
    "ans74":"The empty-cells property specifies whether or not to display borders and background on empty cells in a table.Possible values are: show: the borders of an empty cell are rendered ; hide: the borders of an empty cell are not drawn.",
    "ans75":"The table-layout specifies how the width of table columns is calculated. The possible values are: auto - when column or cell width are not explicitly set, the column width will be in proportion to the amount of content in the cells that make up the column.",
    "ans76":"fixed - when column or cell width are not explicitly set, the column width will not be affected by the amount of content in the cells that make up the column.The table layout is set to auto by default.",
    "Example7":"Css_07",

    "module8":"CSS 3 Introduction",
    "content8":"",
    "ans81":"CSS3 is the latest standard for CSS.CSS3 is completely backwards-compatible with earlier CSS versions.",
    "ans82":"Some of the most significant new features are:Border radius - allows us to create rounded corners for elements.Border images - allows us to specify an image as the border around an element.Multiple backgrounds - applies multiple backgrounds to elements.Animations and effects, and much more!",
    "ans83":"Box Shadow : With the box-shadow property, you can attach one or more shadows to an element by specifying values for color, size, blur, and offset." ,
    "ans84":"Gradients : CSS3 gradients allow us to set the background color of the element to a gradient. Two types of gradients are available: Linear and Radial.Linear Gradients (goes down/up/left/right/diagonally),Radial Gradients (defined by their center)",
    "ans85":"Transforms allow you to rotate, scale, move, and skew elements.Another popular feature is Transitions which allows you to animate from one CSS property value to another. You can combine it with transforms and animate the element's position, rotation, or scale.",
    "ans86":"The property attracting the most attention is Animations.CSS Animations have their own specifications, and they allow you to create keyframes, set duration, easing, and more.",
    "Example8":"Css_08",

    "module9":"Box Shadow",
    "content9":"",
    "ans91":"The CSS3 box-shadow property applies shadow to elements.Components of the box-shadow property are decoded by browsers in the following manner : The first length for the horizontal offset will cast the shadow to the right of the box (required).The second length is for the vertical offset that will cast the shadow to below the box (required).The color of the shadow (optional)",
    "ans92":"Besides color, there are also two optional values for the box-shadow element, which are blur and spread.The blur and spread values should be used before the color value.",
    "ans93":"The 'inset' keyword allows to draw an inner shadow in the box. To show an inset shadow, just add the inset keyword.You can define as many shadows for the same box as you want by writing all of them comma-separated in the same rule.",
    "ans94":"The text-shadow property defines one or more comma-separated shadow effects, to be applied to the text content of the current element.The text-shadow style can accept multiple values in a comma-separated list.",
    "ans95":"",
    "ans96":"",
    "Example9":"Css_09",

    "module10":"Gradients and Backgrounds",
    "content10":"",
    "ans101":"CSS3 gradients enable you to display smooth transitions between two or more specified colors. CSS3 defines two types of gradients: Linear and Radial.",
    "ans102":"To create a linear gradient, you must define at least two color stops. Color stops are the colors among which you want to render smooth transitions.Colors can be added one after the other, separated with a comma. The browser will then determine each color stop position.",
    "ans103":"The direction of the gradient can be changed.the gradient can starts at left, moving right; the second one can start from bottom to top.Syntax : background: linear-gradient(blue, yellow, green, pink, white);",
    "ans104":"To create a radial gradient, you must define at least two color stops.The radial gradient is defined by its center.Syntax : background: radial-gradient(position, shape or size, color-stops)",
    "ans105":"The shape parameter defines the shape. If you do not define the shape of the radial gradient, it will take the ellipse value by default.",
    "ans106":"The background-size property adds new functionality to CSS that allows us to specify the size of background images, using either lengths or percentages.",
    "Example10":"Css_10",

    "module11":"Transitions and Transforms",
    "content11":"",
    "ans111":"CSS3 transitions allow us to change from one property value to another over a given duration.transition-property - specifies the property to be transitioned , transition-duration - specifies the duration over which transitions should occur , transition-timing-function - specifies how the pace of the transition changes over its duration , transition-delay - specifies a delay (in seconds) for the transition effect",
    "ans112":"In the example , the div element has width and height of 50px, with a green background. We specified a transition effect for the width property, with a duration of 3 seconds:",
    "ans113":"The transition-timing-function property specifies the speed curve of the transition effect.It can have the following values : ease - the animation starts slowly, then accelerates quickly.ease-in - starts slowly, then accelerates, and stops abruptly.ease-out - starts quickly, but decelerates to a stop.ease-in-out - similar to ease, but with more subtle acceleration and deceleration.linear - constant speed throughout the animation; often best for color or opacity changes.",
    "ans114":"CSS3 transforms allow you to translate, rotate, scale, and skew elements.A transformation is an effect that lets an element change shape, size, and position.CSS3 supports 2D and 3D transformations.Using a positive value will rotate an element clockwise, and using a negative value will rotate the element counter-clockwise.",
    "ans115":"The translate() method moves an element from its current position (according to the parameters given for the x-axis and the y-axis).",
    "ans116":"The skew() method skews an element along the x-axis and the y-axis by the given angles.The scale() method increases or decreases the size of an element, according to the parameters given for the width and height.Multiple transforms can be used at once. Rotating and scaling the size of an element at the same time is an example of that.Applying multiple transforms to an element is simple; just separate them using spaces.Syntax : transform: rotate(45deg) translate(100px);",
    "Example11":"Css_11",

    "module12":"Animations",
    "content12":"",
    "ans121":"An animation lets an element gradually change from one style to another.You can change as many CSS properties as you want to, as many times you want to.Keyframes hold the styles the element will have at certain times",
    "ans122":"The @keyframes Rule : When you specify CSS styles inside the @keyframes rule, the animation will gradually change from the current style to the new style at certain times.",
    "ans123":"To get an animation to work, you must bind the animation to an element.",
    "ans124":"animation-name property : animation-name property defines which animation to use.Syntax :  animation-name: colorchange;  ",
    "ans125":"The animation-duration property specifies the duration of the selected animation in seconds.Syntax : animation-duration: 5s.The animation-timing-function specifies the speed curve of an animation. It can have the following values : ease - specifies an animation with a slow start, then fast, then end slowly (this is default) ; linear - specifies an animation with the same speed from start to end ; ease-in - specifies an animation with a slow start ; ease-out - specifies an animation with a slow end ; ease-in-out - specifies an animation with a slow start and end",
    "ans126":"The animation-iteration-count property determines the number of times an animation repeats.For example, you can set the animation to run 5 times:",
    "Example12":"Css_12"

    },
    {

        "title":"JS",
        "name":"Js tutorial",
        "shortname":"js",

        "module1":"JavaScript Overview",
        "content1":"",
        "ans11":"JavaScript is one of the most popular programming languages on earth and is used to add interactivity to webpages, process data, as well as create various applications (mobile apps, desktop apps, games, and more)",
        "ans12":"JavaScript on the web lives inside the HTML document.In HTML, JavaScript code must be inserted between <script> and </script> tags.JavaScript can be placed in the HTML page's <body> and <head> sections.",
        "ans13":"Remember that the script, which is placed in the head section, will be executed before the <body> is rendered. If you want to get elements in the body, it's a good idea to place your script at the end of the body tag.",
        "ans14":"The document.write() function writes a string into our HTML document. This function can be used to write text, HTML, or both.Syntax :    document.write('Hello World!''); The document.write() method should be used only for testing.",
        "ans15":"Just like in HTML, we can use HTML tags to format text in JavaScript.Syntax : document.write('<h1>Hello World!</h1>'');",
        "ans16":"Scripts can also be placed in external files.External scripts are useful and practical when the same code is used in a number of different web pages.JavaScript files have the file extension .js.Having JS scripts in separate files makes your code much readable and clearer.",
        "Example1":"js_01",

        "module2":"Basic Concepts",
        "content2":"",
        "ans21":"Variables are containers for storing data values. The value of a variable can change throughout the program.Use the var keyword to declare a variable : var x = 10;JavaScript is case sensitive",
        "ans22":"The term data type refers to the types of values with which a program can work. JavaScript variables can hold many data types, such as numbers, strings, arrays, and more.Unlike many other programming languages, JavaScript does not define different types of numbers, like integers, short, long, floating-point, etc.JavaScript numbers can be written with or without decimals.",
        "ans23":"JavaScript strings are used for storing and manipulating text.A string can be any text that appears within quotes. You can use single or double quotes.Example : var string = 'i am a girl';",
        "ans24":"In JavaScript Boolean, you can have one of two values, either true or false.These are useful when you need a data type that can only have one of two values, such as Yes/No, On/Off, True/False.",
        "ans25":"The Boolean value of 0 (zero), null, undefined, empty string is false.Everything with a 'real' value is true.",
        "ans26":"",
        "Example2":"js_02",

        "module3":"Operators",
        "content3":"",
        "ans31":"Arithmetic operators perform arithmetic functions on numbers (literals or variables).",
        "ans32":"The Addition operator (+) adds two or more number.The multiplication operator (*) multiplies one number by the other.",
        "ans33":"The / operator is used to perform division operations.Modulus (%) operator returns the division remainder (what is left over).",
        "ans34":"Increment ++ : The increment operator increments the numeric value of its operand by one. If placed before the operand, it returns the incremented value. If placed after the operand, it returns the original value and then increments the operand.Decrement -- : The decrement operator decrements the numeric value of its operand by one. If placed before the operand, it returns the decremented value. If placed after the operand, it returns the original value and then decrements the operand.",
        "ans35":"Assignment operators (=) assign values to JavaScript variables.Comparison operators are used in logical statements to determine equality or difference between variables or values. They return true or false.The equal to (==) operator checks whether the operands' values are equal.",
        "ans36":"Logical Operators, also known as Boolean Operators, evaluate the expression and return true or false (AND, OR, NOT).Another JavaScript conditional operator assigns a value to a variable, based on some condition.Syntax : variable = (condition) ? value1: value2 ",
        "Example3":"js_03",

        "module4":"Conditional Statements",
        "content4":"",
        "ans41":"Very often when you write code, you want to perform different actions based on different conditions.You can do this by using conditional statements in your code.Use if to specify a block of code that will be executed if a specified condition is true.The statements will be executed only if the specified condition is true.",
        "ans42":"Use the else statement to specify a block of code that will execute if the condition is false.For example :  If myNum1 is greater than myNum2, alert 'This is my first condition' ; Else, alert 'This is my second condition'.",
        "ans43":"You can use the else if statement to specify a new condition if the first condition is false.The final else block will be executed when none of the conditions is true.",
        "ans44":"In cases when you need to test for multiple conditions, writing if else statements for each condition might not be the best solution.The switch statement is used to perform different actions based on different conditions.",
        "ans45":"The switch expression is evaluated once. The value of the expression is compared with the values of each case. If there is a match, the associated block of code is executed",
        "ans46":"When JavaScript code reaches a break keyword, it breaks out of the switch block.This will stop the execution of more code and case testing inside the block.Usually, a break should be put in each case statement.",
        "Example4":"js_04",

        "module5":"Loops",
        "content5":"",
        "ans51":"",
        "ans52":"",
        "ans53":"",
        "ans54":"",
        "ans55":"",
        "ans56":"",
        "Example5":"",

        "module6":"Functions",
        "content6":"",
        "ans61":"",
        "ans62":"",
        "ans63":"",
        "ans64":"",
        "ans65":"",
        "ans66":"",
        "Example6":"",

        "module7":"Objects",
        "content7":"",
        "ans71":"",
        "ans72":"",
        "ans73":"",
        "ans74":"",
        "ans75":"",
        "ans76":"",
        "Example7":"",

        "module8":"DOM (Document Object Model)",
        "content8":"",
        "ans81":"",
        "ans82":"",
        "ans83":"",
        "ans84":"",
        "ans85":"",
        "ans86":"",
        "Example8":"",

        "module9":"Event Handlers",
        "content9":"",
        "ans91":"",
        "ans92":"",
        "ans93":"",
        "ans94":"",
        "ans95":"",
        "ans96":"",
        "Example9":"",

        "module10":"Event Listeners",
        "content10":"",
        "ans101":"",
        "ans102":"",
        "ans103":"",
        "ans104":"",
        "ans105":"",
        "ans106":"",
        "Example10":"",

        "module11":"Form Validation",
        "content11":"",
        "ans111":"",
        "ans112":"",
        "ans113":"",
        "ans114":"",
        "ans115":"",
        "ans116":"",
        "Example11":"",

        "module12":"Animations",
        "content12":"",
        "ans121":"",
        "ans122":"",
        "ans123":"",
        "ans124":"",
        "ans125":"",
        "ans126":"",
        "Example12":"js_12"

    },
    {

        "title":"Angular Js",
        "name":"Angular Js tutorial",
        "shortname":"ang",

        "module1":"AngularJs Overview",
        "content1":"",
        "ans11":"",
        "ans12":"",
        "ans13":"",
        "ans14":"",
        "ans15":"",
        "ans16":"",
        "Example1":"",

        "module2":"Expressions",
        "content2":"",
        "ans21":"",
        "ans22":"",
        "ans23":"",
        "ans24":"",
        "ans25":"",
        "ans26":"",
        "Example2":"",

        "module3":"Angular Module",
        "content3":"",
        "ans31":"",
        "ans32":"",
        "ans33":"",
        "ans34":"",
        "ans35":"",
        "ans36":"",
        "Example3":"",

        "module4":"Angular Directives",
        "content4":"",
        "ans41":"",
        "ans42":"",
        "ans43":"",
        "ans44":"",
        "ans45":"",
        "ans46":"",
        "Example4":"",

        "module5":"Angular Controllers",
        "content5":"",
        "ans51":"",
        "ans52":"",
        "ans53":"",
        "ans54":"",
        "ans55":"",
        "ans56":"",
        "Example5":"",

        "module6":"Angular Services",
        "content6":"",
        "ans61":"",
        "ans62":"",
        "ans63":"",
        "ans64":"",
        "ans65":"",
        "ans66":"",
        "Example6":"",

        "module7":"Angular Http",
        "content7":"",
        "ans71":"",
        "ans72":"",
        "ans73":"",
        "ans74":"",
        "ans75":"",
        "ans76":"",
        "Example7":"",

        "module8":"Angular DOM",
        "content8":"",
        "ans81":"",
        "ans82":"",
        "ans83":"",
        "ans84":"",
        "ans85":"",
        "ans86":"",
        "Example8":"",

        "module9":"Angular Events",
        "content9":"",
        "ans91":"",
        "ans92":"",
        "ans93":"",
        "ans94":"",
        "ans95":"",
        "ans96":"",
        "Example9":"",

        "module10":"Angular Forms and Validation",
        "content10":"",
        "ans101":"",
        "ans102":"",
        "ans103":"",
        "ans104":"",
        "ans105":"",
        "ans106":"",
        "Example10":"",

        "module11":"Angular Routing",
        "content11":"",
        "ans111":"",
        "ans112":"",
        "ans113":"",
        "ans114":"",
        "ans115":"",
        "ans116":"",
        "Example11":"",


        "module12":"Angular Includes",
        "content12":"",
        "ans121":"",
        "ans122":"",
        "ans123":"",
        "ans124":"",
        "ans125":"",
        "ans126":"",
        "Example12":"Ang_12"

    },
    {


        "title":"Node Js",
        "name":"Node Js tutorial",
        "shortname":"nodejs",

        "module1":"NodeJs Overview",
        "content1":"",
        "ans11":"",
        "ans12":"",
        "ans13":"",
        "ans14":"",
        "ans15":"",
        "ans16":"",
        "Example1":"",

        "module2":"Http Module",
        "content2":"",
        "ans21":"",
        "ans22":"",
        "ans23":"",
        "ans24":"",
        "ans25":"",
        "ans26":"",
        "Example2":"",

        "module3":"File Handeling",
        "content3":"",
        "ans31":"",
        "ans32":"",
        "ans33":"",
        "ans34":"",
        "ans35":"",
        "ans36":"",
        "Example3":"",

        "module4":"Server Side Js",
        "content4":"",
        "ans41":"",
        "ans42":"",
        "ans43":"",
        "ans44":"",
        "ans45":"",
        "ans46":"",
        "Example4":"",


        "module5":"Node Js Routing",
        "content5":"",
        "ans51":"",
        "ans52":"",
        "ans53":"",
        "ans54":"",
        "ans55":"",
        "ans56":"",
        "Example5":"",

        "module6":"Working with MySQL",
        "content6":"",
        "ans61":"",
        "ans62":"",
        "ans63":"",
        "ans64":"",
        "ans65":"",
        "ans66":"",
        "Example6":"",

        "module7":"Create Database",
        "content7":"",
        "ans71":"",
        "ans72":"",
        "ans73":"",
        "ans74":"",
        "ans75":"",
        "ans76":"",
        "Example7":"",

        "module8":"Create Table",
        "content8":"",
        "ans81":"",
        "ans82":"",
        "ans83":"",
        "ans84":"",
        "ans85":"",
        "ans86":"",
        "Example8":"",


        "module9":"Insert Query",
        "content9":"",
        "ans91":"",
        "ans92":"",
        "ans93":"",
        "ans94":"",
        "ans95":"",
        "ans96":"",
        "Example9":"",

        "module10":"Select Query",
        "content10":"",
        "ans101":"",
        "ans102":"",
        "ans103":"",
        "ans104":"",
        "ans105":"",
        "ans106":"",
        "Example10":"",

        "module11":"Drop , Delete and so on..",
        "content11":"",
        "ans111":"",
        "ans112":"",
        "ans113":"",
        "ans114":"",
        "ans115":"",
        "ans116":"",
        "Example11":"",

        "module12":"Api Handeling",
        "content12":"",
        "ans121":"",
        "ans122":"",
        "ans123":"",
        "ans124":"",
        "ans125":"",
        "ans126":"",
        "Example12":"Node_12"
    },
    {

        "title":"MySql",
        "name":"MySql tutorial",
        "shortname":"mysql",

        "module1":"MySql Overview",
        "content1":"",
        "ans11":"",
        "ans12":"",
        "ans13":"",
        "ans14":"",
        "ans15":"",
        "ans16":"",
        "Example1":"",

        "module2":"Sql Syntax",
        "content2":"",
        "ans21":"",
        "ans22":"",
        "ans23":"",
        "ans24":"",
        "ans25":"",
        "ans26":"",
        "Example2":"",

        "module3":"Create Database",
        "content3":"",
        "ans31":"",
        "ans32":"",
        "ans33":"",
        "ans34":"",
        "ans35":"",
        "ans36":"",
        "Example3":"",

        "module4":"Create Table",
        "content4":"",
        "ans41":"",
        "ans42":"",
        "ans43":"",
        "ans44":"",
        "ans45":"",
        "ans46":"",
        "Example4":"",

        "module5":"Insert Into",
        "content5":"",
        "ans51":"",
        "ans52":"",
        "ans53":"",
        "ans54":"",
        "ans55":"",
        "ans56":"",
        "Example5":"",

        "module6":"Drop Database",
        "content6":"",
        "ans61":"",
        "ans62":"",
        "ans63":"",
        "ans64":"",
        "ans65":"",
        "ans66":"",
        "Example6":"",

        "module7":"Backup Database",
        "content7":"",
        "ans71":"",
        "ans72":"",
        "ans73":"",
        "ans74":"",
        "ans75":"",
        "ans76":"",
        "Example7":"",

        "module8":"Alter Database",
        "content8":"",
        "ans81":"",
        "ans82":"",
        "ans83":"",
        "ans84":"",
        "ans85":"",
        "ans86":"",
        "Example8":"",

        "module9":"Primary key and Foreign key",
        "content9":"",
        "ans91":"",
        "ans92":"",
        "ans93":"",
        "ans94":"",
        "ans95":"",
        "ans96":"",
        "Example9":"",

        "module10":"Unique and Not Null",
        "content10":"",
        "ans101":"",
        "ans102":"",
        "ans103":"",
        "ans104":"",
        "ans105":"",
        "ans106":"",
        "Example10":"",

        "module11":"Sql Constraints",
        "content11":"",
        "ans111":"",
        "ans112":"",
        "ans113":"",
        "ans114":"",
        "ans115":"",
        "ans116":"",
        "Example11":"",

        "module12":"Sql Injection",
        "content12":"",
        "ans121":"",
        "ans122":"",
        "ans123":"",
        "ans124":"",
        "ans125":"",
        "ans126":"",
        "Example12":"Sql_12"
    }]
}
